import networkx as nx
import matplotlib.pyplot as plt

G = nx.Graph()

cities = [
    "Київ", "Харків", "Дніпро", "Одеса", "Запоріжжя", "Львів", "Кривий Ріг",
    "Миколаїв", "Вінниця", "Херсон", "Полтава", "Чернігів",
    "Черкаси", "Хмельницький", "Чернівці", "Житомир", "Суми", "Рівне",
    "Івано-Франківськ", "Тернопіль", "Луцьк", "Ужгород", "Донецьк", "Луганськ", "Сімферополь"
]
G.add_nodes_from(cities)

roads = [
    ("Київ", "Харків"),("Київ", "Житомир"), ("Київ", "Дніпро"), ("Київ", "Одеса"), ("Київ", "Львів"),
    ("Київ", "Вінниця"), ("Київ", "Чернігів"), ("Київ",
                                                "Черкаси"), ("Харків", "Дніпро"),
    ("Дніпро", "Запоріжжя"), ("Дніпро", "Одеса"), ("Дніпро", "Кривий Ріг"),
    ("Одеса", "Миколаїв"), ("Запоріжжя", "Донецьк"), ("Львів", "Хмельницький"),
    ("Львів", "Чернівці"), ("Львів",
                            "Тернопіль"), ("Львів", "Луцьк"), ("Львів", "Ужгород"),
    ("Вінниця", "Хмельницький"), ("Вінниця", "Житомир"), ("Херсон", "Миколаїв"),
    ("Херсон", "Запоріжжя"), ("Полтава", "Харків"), ("Полтава", "Дніпро"),
    ("Чернігів", "Суми"), ("Черкаси", "Кіровоград"), ("Черкаси", "Полтава"),
    ("Чернівці", "Івано-Франківськ"), ("Житомир", "Рівне"), ("Суми", "Харків"),
    ("Рівне", "Луцьк"), ("Івано-Франківськ", "Тернопіль"), ("Донецьк", "Луганськ"), ("Сімферополь", "Херсон")
]
G.add_edges_from(roads)

plt.figure(figsize=(15, 10))
pos = nx.spring_layout(G, seed=42) 
nx.draw(G, pos, with_labels=True, node_size=700,
        node_color="lightblue", font_size=10, font_weight="bold")
plt.title("Транспортна мережа обласних центрів України")
plt.show()

num_nodes = G.number_of_nodes()
num_edges = G.number_of_edges()
degrees = dict(G.degree())

print(f"Кількість вершин: {num_nodes}")
print(f"Кількість ребер: {num_edges}")
print(f"Ступінь вершин: {degrees}")
